"""
字典练习:
        升职加薪:
                对所有级别为1级的员工级别+1,薪水+1000
"""
staff = {
    "张三": {
        "部门": "科技部",
        "工资": 3000,
        "级别": 1
    }, "李四": {
        "部门": "市场部",
        "工资": 5000,
        "级别": 2
    }, "王五": {
        "部门": "市场部",
        "工资": 7000,
        "级别": 3
    }, "赵六": {
        "部门": "科技部",
        "工资": 4000,
        "级别": 1
    }, "李思思": {
        "部门": "市场部",
        "工资": 6000,
        "级别": 2
    }
}

print(f"调整前{staff}")

for key in staff:
    num = staff[key]["级别"] == 1
    if num == 1:
        staff[key]["级别"] = 2
        staff[key]["工资"] += 1000

print(f"调整后{staff}")
