"""
字典(键值对)
key不可重复
不可使用下表索引
"""
# 定义字典
d1 = {"张三": 99, "李思思": 88, "王五": 77}

# 空字典
d2 = {}
d3 = dict()

# 重复key的字典
d4 = {"张三": 88, "张三": 77, "李四": 66}
print(f"重复字典d4的值为{d4}")

# 基于key取出value
d_ = d1["王五"]
print(f"字典{d1}中王五的分数:{d_}")

# 定义嵌套字典  (key不可为字典)
score = {
    "zhangsan": {
        "语文": 99,
        "数学": 20,
        "英语": 10
    },
    "lisi": {
        "语文": 10,
        "数学": 20,
        "英语": 10
    }
}

print(score)

# 从嵌套字典中获取value
lisi_ = score["lisi"]["英语"]
print(f"lisi的英语成绩{lisi_}")
